      ******************************************************************
      * Author:
      * Date:
      * Purpose:
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. DIVISION_DE_DATOS.

       DATA DIVISION.

       FILE SECTION.
      * Aqui iran los archivos que se utilizaran.

       WORKING-STORAGE SECTION.
      * Aqui pondremos todas las variables que vamos a usar en el programa.

       LINKAGE SECTION.
      * Aqui se registran las variables que maneja el sistema principal.


       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hello world"
            STOP RUN.
       END PROGRAM DIVISION_DE_DATOS.
