
       IDENTIFICATION DIVISION.
       PROGRAM-ID. Capitulo-7.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  SALUDO PIC X(25) VALUE "Este teto se va a mostrar".

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY SALUDO.
            STOP RUN.
       END PROGRAM Capitulo-7.
